---
lab:
    title: '15 - Azure Sentinel'
    module: 'モジュール 04 - セキュリティ操作の管理'
---

# 課題 15: Azure Sentinel
# 受講生用ラボ マニュアル

## ラボのシナリオ

Azure Sentinel ベースの脅威検出と応答の概念実証を作成するよう依頼されました。具体的には、次のことを行います。

- Azure アクティビティと Security Center からデータの収集を開始します。
- 組み込みおよびカスタム アラートを追加する 
- プレイブックを使用してインシデントへの応答を自動化する方法を確認します。

> このラボのすべてのリソースについて、**米国東部** リージョンを使用しています。クラスに使用する地域であることを講師に確認します。 

## ラボの目的

このラボでは、次の演習を行います。

- 演習 1: Azure Sentinel の実装

## ラボ ファイル：

- **\\Allfiles\\Labs\\15\\changeincidentseverity.json**

### 演習 1: Azure Sentinel の実装

### 予想時間: 30 分

この演習では、次のタスクを行います。

- タスク 1: Azure Sentinel をオンボードにする
- タスク 2: Azure アクティビティを Sentinel に接続する
- タスク 3: Azure アクティビティ データ コネクタを使用するルールを作成します。 
- タスク 4: プレイブックを作成する
- タスク 5: カスタム アラートを作成し、自動化された応答としてプレイブックを構成します。
- タスク 6: インシデントを呼び出し、関連するアクションを確認します。

#### タスク 1: Azure Sentinel をオンボードにする

このタスクでは、Azure Sentinel にオンボードし、Log Analytics ワークスペースを接続します。 

1. Azure portal **`https://portal.azure.com/`** にサインインします。

    >**注意**: このラボで使用している Azure サブスクリプションで所有者ロールまたは共同作成者ロールを持つアカウントを使用して Azure ポータルにサインインします。

1. Azure portal で Azure portal ページの上部にある **「リソース、サービス、ドキュメントの検索」** テキスト ボックスで、**「Azure Sentinel」** と入力し、**「Enter」** キーを押します。

1. **「Azure Sentinel」** ブレードで、**「ワークスペースの接続」** をクリックします。

1. **「Azure Sentinel に追加するワークスペースの選択」** ブレードで、Azure Monitor ラボで作成した 「Log Analytics ワークスペース」 を選択し、**「追加」** をクリックします。

    >**注意**: Azure Sentinel には、ワークスペースに対して非常に具体的な要件があります。たとえば、Azure Security Center によって作成されたワークスペースは使用できません。[クイック スタート: Azure Sentinel をオンボードにする](https://docs.microsoft.com/ja-jp/azure/sentinel/quickstart-onboard)
	
#### タスク 2: Azure アクティビティ データ コネクタを使用するように Azure Sentinel を構成します。 

このタスクでは、Azure アクティビティ データ コネクタを使用するように Sentinel を構成します。  

1. Azure portal の **Azure Sentinel \| 「概要」** ブレードの **「構成」** セクションで 、**「データ コネクタ」** をクリックします。 

1. 「**Azure Sentinel**」**| 「データ コネクタ」** ブレードで、使用可能なコネクタの一覧を確認し、**Azure アクティビティ** コネクタ（必要であれば右にスクロールする）を表すエントリをクリックして説明を確認し、**「コネクタ ページを開く」** をクリックします。

1. **「Azure アクティビティ」** ブレードで、**「Azure アクティビティ ログの構成」** リンクをクリックします。

1. **「Azure アクティビティ ログ」** ブレードで、このラボで使用している Azure サブスクリプションを表すエントリをクリックし、 **「接続」** をクリックします。

1. **Azure Sentinel** に戻ります。**|「データ コネクタ」** ブレードをクリックし、**「更新」** をクリックします。

1. 「**Azure Sentinel**」**| 「データ コネクタ」** ブレードで、**「Azure アクティビティ」** をクリックします。 

1. 「**Azure アクティビティ**」 ウィンドウに 「**受信したデータ**」 グラフが表示されていることを確認します（ブラウザ ページを更新する必要がある場合があります）。 

    >**注意**: Azure のアクティビティ ログに含まれるイベントがグラフに反映されるまでに5分以上かかる場合があります。

#### タスク 3: Azure アクティビティ データ コネクタを使用するルールを作成します。 

このタスクでは、Azure アクティビティ データ コネクタを使用するルールを確認し、作成します。 

1. 「**Azure Sentinel**」**| 「構成」** ブレードで、**「分析」** をクリックします。 

1. 「**Azure Sentinel**」**| 「分析」** ブレードで、**「ルール テンプレート」** タブをクリックします。 

    >**注意**: 作成できるルールの種類を確認します。各ルールは、特定のデータ ソースに関連付けられます。

1. ルールの一覧で、検索バーフォームに「**不審**」と入力し、**Azure アクティビティ** データソースに関連付けられている 「**不審なリソースの作成またはデプロイの数**」 エントリをクリックします。次に、ルール テンプレートのプロパティを表示しているウィンドウで、「**ルールの作成**」 をクリックします（必要であればページの右側にスクロールする）。

    >**注意**: このルールの重大度は中程度です。 

1. **「分析ルール ウィザード - テンプレートから新しいルールを作成」** ブレードの **「全般」** タブで、既定の設定をそのまま使用し、**「次へ」** をクリックします。**ルール ロジックを設定 >**。

1. **「分析ルール ウィザード - テンプレートから新しいルールを作成する」** ブレードの **「ルール ロジックの設定」** タブで、既定の設定をそのまま使用し、**「次へ」** をクリックします。**インシデントの設定 >**。

1. **分析ルール ウィザード - テンプレートから新しいルールを作成」** ブレードの **「インシデント設定」** タブで、既定の設定をそのまま使用し、**「次へ」** をクリックします。**自動応答 >**。 

    >**注意**: この機能を使用すると、ロジック アプリとして実装されたプレイブックをルールに追加して、問題の修復を自動化できます。

1. **「分析ルール ウィザード - テンプレートから新しいルールを作成」** ブレードの **「自動応答」** タブで、既定の設定をそのまま使用し、**「次へ」** をクリックします。**レビュー >**。 

1. **「分析ルール ウィザード - テンプレートから新しいルールを作成する」** ブレードの **「確認と作成」** タブで 、**「作成」** をクリックします。

    >**注意**: これで、アクティブなルールが作成されました。

#### タスク 4: プレイブックを作成する

このタスクでは、プレイブックを作成します。セキュリティ プレイブックは、アラートに応答して Azure Sentinel によって呼び出すことができるタスクのコレクションです。 

1. Azure portal で Azure portal ページの上部にある **「リソース、サービス、ドキュメントの検索」** テキスト ボックスで、**「カスタム テンプレートをデプロイする」** と入力し、**「Enter」** キーを押します。

1. **Custom deployment** ブレードで、**エディターで独自のテンプレートをビルド** のオプションをクリックします。

1. **「テンプレートの編集」** ブレードで、**「ロード ファイル」** をクリックし、**\\Allfiles\\Labs\\15\\changeincidentseverity.json** ファイルを見つけて、**「開く」** をクリックします。

    >**注意**: サンプル プレイブックは、[https://github.com/Azure/Azure-Sentinel/tree/master/Playbooks](https://github.com/Azure/Azure-Sentinel/tree/master/Playbooks) にあります。

1. **「テンプレートの編集」** ブレードで、**「保存」** をクリックします。

1. **「カスタム デプロイ」** ブレードで、次の設定が構成されていることを確認します (既定値を使用して他の設定を行います)。

    |設定|値|
    |---|---|
    |サブスクリプション|このラボで使用する Azure サブスクリプションの名前|
    |リソース グループ|**AZ500LAB131415**|
    |場所|**(US) East US**|
    |プレイブックの名前|**Change-Incident-Severity**|
    |ユーザー名|ご使用のメール アドレス|

1. **「レビューと作成」** をクリックし、**「作成」** をクリックします。

    >**注意**: デプロイが完了するのを待ちます。

1. Azure portal の、Azure portal ページの上部にある **「ソース、サービス、ドキュメントの検索」** テキスト ボックスで、 **「リソース グループ」**と入力し、**「Enter」** キーを押します。

1. 「**リソース グループ**」 ブレードのリソース グループの一覧で、「**AZ500LAB131415**」 エントリをクリックします。

1. **「AZ500LAB131415」** リソース グループ ブレードのリソースの一覧で、新しく作成された **Change-Incident-Severity** ロジック アプリを表すエントリをクリックします。

1. **「インシデントの重大度の変更」** ブレードで、**「編集」** をクリックします。

    >**注意**: **「Logic Apps デザイナー」** ブレードでは、4 つの接続のそれぞれに警告が表示されます。これは、それぞれが確認し設定する必要があることを意味します。

1. **「Logic Apps デザイナー」** ブレードで、最初の **「接続」** 手順をクリックします。

1. **「新規追加」** をクリックし、**「テナント」** ドロップダウン リストのエントリに Azure ADテナント名が含まれていることを確認し、**「サインイン」** をクリックします。

1. プロンプトが表示された場合は、このラボで使用する Azure サブスクリプションの所有者または共同作成者のロールを使用したユーザー アカウントでログインします。

1. それぞれの**接続**に対して、前の 3 つの手順を繰り返します。

    >**注意**: いずれの手順にも警告が表示されていないことを確認します。

1. **「Logic Apps デザイナー」** ブレードで、**「保存」** をクリックして変更を保存します。

#### タスク 5: カスタム アラートを作成し、自動化された応答としてプレイブックを構成する

1. Azure portal で、**Azure Sentinel** に移動します。**|「概要」** ブレード。

1. 「**Azure Sentinel**」 **|「概要」** ブレードの **「構成」** セクションで 、**「分析」** をクリックします。

1. 「**Azure Sentinel**」**| 「分析」** ブレードで **「+ 作成」** をクリックし、ドロップダウン メニューの **「スケジュールされたクエリ ルール」** をクリックします。 

1. **「分析ルール ウィザード - 新しいルールの作成」** ブレードの **「全般」** タブで、次の設定を指定します (既定値を他のユーザーのままにします)。

    |設定|値|
    |---|---|
    |名前|**プレイブック デモ**|
    |戦術|**初回アクセス**|

1. 「**次へ**」 をクリックします。**ルール ロジックを設定 >**。

1. **「分析ルール ウィザード - 新しいルールの作成」** ブレードの **「ルール ロジックの設定」** タブ で、**「ルール クエリ」** テキスト ボックスに次のルール クエリを貼り付けます。 

    ```
    AzureActivity
     | where ResourceProviderValue == "Microsoft.Security" 
     | where OperationNameValue == "Microsoft.Security/locations/jitNetworkAccessPolicies/delete" 
    ```

    >**注意**: このルールは、Just In Time VM アクセス ポリシーの削除を識別します。

    >**注**: 解析エラーが発生した場合、IntelliSense がクエリに値を追加している可能性があります。クエリが一致していることを確認し、それ以外の場合は、クエリをメモ帳に貼り付け、メモ帳からルール クエリに貼り付けます。 


1. **「分析ルール ウィザード - 新しいルールの作成」** ブレードの **「ルール ロジックの設定」** タブ の **「クエリのスケジュール」** セクションで、**「クエリを実行する間隔」** を **「5 分ごとに実行」** に設定します。

1. **「分析ルール ウィザード - 新しいルールの作成」** ブレードの **「ルール ロジックの設定」** タブで 、残りの設定の既定値をそのまま使用し、**「次へ」** をクリックします。**インシデントの設定 >**。

1. **「分析ルール ウィザード - 新しいルールの作成」** ブレードの **「インシデント設定」** タブで、既定の設定をそのまま使用し、**「次へ」** をクリックします。**自動応答 >**。 

1. **「分析ルール ウィザード - 新しいルールの作成」** ブレードの **「自動応答」** タブで、**「インシデントの重要度の変更」** チェックボックスを選択し、**「次へ」** をクリックします。**レビュー >**。 

1. **「分析ルール ウィザード - 新しいルールの作成」** ブレードの **「確認と作成」** タブで、**「作成」** をクリックします。

    >**注意**: これで、**プレイブック デモ**と呼ばれる新しいアクティブなルールが作成されます。rue ロジックによって識別されたイベントが発生すると、中程度の重大度アラートが発生し、対応するインシデントが生成されます。

#### タスク 6: インシデントを呼び出し、関連するアクションを確認します。

1. Azure portal で、**Security Center** に移動します。**|「概要」** ブレード。

    >**注意**: セキュア スコアを確認してください。すでに更新されているはずです。 

1. 「**Security Center| Azure Defender**」 ブレードで、「**ジャスト イン タイム VM アクセス**」 セクションをクリックします。

1. 「**Security Center」| 「Just In Time VM アクセス」** ブレードで 、**myVM** 仮想マシンを参照する行の右側で、**「省略」** ボタンをクリックし、**「削除」** をクリックし、**「はい」** をクリックします。

1. Azure portal で、Azure portal ページの上部にある **「リソース、サービス、ドキュメントの検索」** テキスト ボックスで、**「アクティビティ ログ」** を入力し、**「Enter」** キーを押します。

1. **「アクティビティ ログ」** ブレードで、**「JIT ネットワーク アクセス ポリシーの削除」** エントリをメモします。 

    >**注意**: 表示されるまでに数分かかることがあります。 

1. Azure portal で、**Azure Sentinel** に移動します。**|「概要」** ブレード。

1. 「**Azure Sentinel**」**| 「概要」** ブレードでダッシュボードを確認し、Just In Time VM アクセス ポリシーの削除に対応するアラートが表示されることを確認します。

    >**注意**: アラートが **Azure Sentinel** に表示されるまでに最大 5 分かかる場合があります。**|「概要」** ブレード。その時点でアラートが表示されない場合は、前のタスクで参照されているクエリ ルールを実行して、Just In Time アクセス ポリシーの削除アクティビティが、Azure Sentinel インスタンスに関連付けられた Log Analytics ワークスペースに伝達されていることを確認します。それ以下の場合は、Just in time VM アクセス ポリシーを再作成し、もう一度削除します。

1. 「**Azure Sentinel**」**| 「概要」** ブレードの 「**脅威の管理**」 セクションで、「**インシデント**」 をクリック します。

1. ブレードに中程度または高い重大度レベルのインシデントが表示されることを確認します。

    >**注意**: インシデントが **Azure Sentinel** に表示されるまでに最大5分かかる場合があります **| インシデント** ブレード。 

    >**注意**: **Azure Sentinel** の確認 **| プレイブック** ブレード。成功した実行と失敗した実行の数がわかります。

    >**注意**: インシデントに別の重大度レベルとステータスを割り当てるオプションがあります。

> 結果: Azure Sentinel ワークスペースを作成し、Azure アクティビティ ログに接続し、ジャスト イン タイム VM アクセス ポリシーの削除に応答してトリガーされるプレイブックとカスタム アラートを作成し、構成が有効であることを確認しました。

**リソースをクリーン アップします**

> Azure リソースのうち、使用しないリソースは必ず削除してください。使用していないリソースを削除することで、予期しないコストが発生しなくなります。 

1. Azure portal から、Azure portal の右上にあるアイコンをクリックして、 Cloud Shell を開きます。メッセージが表示されたら、「**PowerShell**」 と 「**ストレージの作成**」 をクリックします。

1. 「Cloud Shell」 ウィンドウの左上隅にあるドロップダウン メニューで 「**PowerShell**」 が選択されていることを確認します。

1. 「クラウド シェル」 ウィンドウ内の 「PowerShell」 セッションで、次の手順を実行して、このラボで作成したリソース グループを削除します。
  
    ```powershell
    Remove-AzResourceGroup -Name "AZ500LAB131415" -Force -AsJob
    ```
1. **「Cloud Shell」** ウィンドウを閉じます。
